GopalSaraf/Practicals/PSDL/include/proc/pic16lf1768.inc
// Register: PWM4DCH
#define PWM4DCH PWM4DCH
PWM4DCH                                  equ 061Bh
// bitfield definitions
PWM4DCH_DC_POSN                          equ 0000h
PWM4DCH_DC_POSITION                      equ 0000h
PWM4DCH_DC_SIZE                          equ 0008h
PWM4DCH_DC_LENGTH                        equ 0008h
PWM4DCH_DC_MASK                          equ 00FFh
PWM4DCH_DC2_POSN                         equ 0000h
PWM4DCH_DC2_POSITION                     equ 0000h
PWM4DCH_DC2_SIZE                         equ 0001h
PWM4DCH_DC2_LENGTH                       equ 0001h
PWM4DCH_DC2_MASK                         equ 0001h
PWM4DCH_DC3_POSN                         equ 0001h
PWM4DCH_DC3_POSITION                     equ 0001h
PWM4DCH_DC3_SIZE                         equ 0001h
PWM4DCH_DC3_LENGTH                       equ 0001h
PWM4DCH_DC3_MASK                         equ 0002h
PWM4DCH_DC4_POSN                         equ 0002h
PWM4DCH_DC4_POSITION                     equ 0002h
PWM4DCH_DC4_SIZE                         equ 0001h
PWM4DCH_DC4_LENGTH                       equ 0001h
PWM4DCH_DC4_MASK                         equ 0004h
PWM4DCH_DC5_POSN                         equ 0003h
PWM4DCH_DC5_POSITION                     equ 0003h
PWM4DCH_DC5_SIZE                         equ 0001h
PWM4DCH_DC5_LENGTH                       equ 0001h
PWM4DCH_DC5_MASK                         equ 0008h
PWM4DCH_DC6_POSN                         equ 0004h
PWM4DCH_DC6_POSITION                     equ 0004h
PWM4DCH_DC6_SIZE                         equ 0001h
PWM4DCH_DC6_LENGTH                       equ 0001h
PWM4DCH_DC6_MASK                         equ 0010h
PWM4DCH_DC7_POSN                         equ 0005h
PWM4DCH_DC7_POSITION                     equ 0005h
PWM4DCH_DC7_SIZE                         equ 0001h
PWM4DCH_DC7_LENGTH                       equ 0001h
PWM4DCH_DC7_MASK                         equ 0020h
PWM4DCH_DC8_POSN                         equ 0006h
PWM4DCH_DC8_POSITION                     equ 0006h
PWM4DCH_DC8_SIZE                         equ 0001h
PWM4DCH_DC8_LENGTH                       equ 0001h
PWM4DCH_DC8_MASK                         equ 0040h
PWM4DCH_DC9_POSN                         equ 0007h
PWM4DCH_DC9_POSITION                     equ 0007h
PWM4DCH_DC9_SIZE                         equ 0001h
PWM4DCH_DC9_LENGTH                       equ 0001h
PWM4DCH_DC9_MASK                         equ 0080h
PWM4DCH_PWM4DC2_POSN                     equ 0000h
PWM4DCH_PWM4DC2_POSITION                 equ 0000h
PWM4DCH_PWM4DC2_SIZE                     equ 0001h
PWM4DCH_PWM4DC2_LENGTH                   equ 0001h
PWM4DCH_PWM4DC2_MASK                     equ 0001h
PWM4DCH_PWM4DC3_POSN                     equ 0001h
PWM4DCH_PWM4DC3_POSITION                 equ 0001h
PWM4DCH_PWM4DC3_SIZE                     equ 0001h
PWM4DCH_PWM4DC3_LENGTH                   equ 0001h
PWM4DCH_PWM4DC3_MASK                     equ 0002h
PWM4DCH_PWM4DC4_POSN                     equ 0002h
PWM4DCH_PWM4DC4_POSITION                 equ 0002h
PWM4DCH_PWM4DC4_SIZE                     equ 0001h
PWM4DCH_PWM4DC4_LENGTH                   equ 0001h
PWM4DCH_PWM4DC4_MASK                     equ 0004h
PWM4DCH_PWM4DC5_POSN                     equ 0003h
PWM4DCH_PWM4DC5_POSITION                 equ 0003h
PWM4DCH_PWM4DC5_SIZE                     equ 0001h
PWM4DCH_PWM4DC5_LENGTH                   equ 0001h
PWM4DCH_PWM4DC5_MASK                     equ 0008h
PWM4DCH_PWM4DC6_POSN                     equ 0004h
PWM4DCH_PWM4DC6_POSITION                 equ 0004h
PWM4DCH_PWM4DC6_SIZE                     equ 0001h
PWM4DCH_PWM4DC6_LENGTH                   equ 0001h
PWM4DCH_PWM4DC6_MASK                     equ 0010h
PWM4DCH_PWM4DC7_POSN                     equ 0005h
PWM4DCH_PWM4DC7_POSITION                 equ 0005h
PWM4DCH_PWM4DC7_SIZE                     equ 0001h
PWM4DCH_PWM4DC7_LENGTH                   equ 0001h
PWM4DCH_PWM4DC7_MASK                     equ 0020h
PWM4DCH_PWM4DC8_POSN                     equ 0006h
PWM4DCH_PWM4DC8_POSITION                 equ 0006h
PWM4DCH_PWM4DC8_SIZE                     equ 0001h
PWM4DCH_PWM4DC8_LENGTH                   equ 0001h
PWM4DCH_PWM4DC8_MASK                     equ 0040h
PWM4DCH_PWM4DC9_POSN                     equ 0007h
PWM4DCH_PWM4DC9_POSITION                 equ 0007h
PWM4DCH_PWM4DC9_SIZE                     equ 0001h
PWM4DCH_PWM4DC9_LENGTH                   equ 0001h
PWM4DCH_PWM4DC9_MASK                     equ 0080h
PWM4DCH_PWMPW2_POSN                      equ 0000h
PWM4DCH_PWMPW2_POSITION                  equ 0000h
PWM4DCH_PWMPW2_SIZE                      equ 0001h
PWM4DCH_PWMPW2_LENGTH                    equ 0001h
PWM4DCH_PWMPW2_MASK                      equ 0001h
PWM4DCH_PWMPW3_POSN                      equ 0001h
PWM4DCH_PWMPW3_POSITION                  equ 0001h
PWM4DCH_PWMPW3_SIZE                      equ 0001h
PWM4DCH_PWMPW3_LENGTH                    equ 0001h
PWM4DCH_PWMPW3_MASK                      equ 0002h
PWM4DCH_PWMPW4_POSN                      equ 0002h
PWM4DCH_PWMPW4_POSITION                  equ 0002h
PWM4DCH_PWMPW4_SIZE                      equ 0001h
PWM4DCH_PWMPW4_LENGTH                    equ 0001h
PWM4DCH_PWMPW4_MASK                      equ 0004h
PWM4DCH_PWMPW5_POSN                      equ 0003h
PWM4DCH_PWMPW5_POSITION                  equ 0003h
PWM4DCH_PWMPW5_SIZE                      equ 0001h
PWM4DCH_PWMPW5_LENGTH                    equ 0001h
PWM4DCH_PWMPW5_MASK                      equ 0008h
PWM4DCH_PWMPW6_POSN                      equ 0004h
PWM4DCH_PWMPW6_POSITION                  equ 0004h
PWM4DCH_PWMPW6_SIZE                      equ 0001h
PWM4DCH_PWMPW6_LENGTH                    equ 0001h
PWM4DCH_PWMPW6_MASK                      equ 0010h
PWM4DCH_PWMPW7_POSN                      equ 0005h
PWM4DCH_PWMPW7_POSITION                  equ 0005h
PWM4DCH_PWMPW7_SIZE                      equ 0001h
PWM4DCH_PWMPW7_LENGTH                    equ 0001h
PWM4DCH_PWMPW7_MASK                      equ 0020h
PWM4DCH_PWMPW8_POSN                      equ 0006h
PWM4DCH_PWMPW8_POSITION                  equ 0006h
PWM4DCH_PWMPW8_SIZE                      equ 0001h
PWM4DCH_PWMPW8_LENGTH                    equ 0001h
PWM4DCH_PWMPW8_MASK                      equ 0040h
PWM4DCH_PWMPW9_POSN                      equ 0007h
PWM4DCH_PWMPW9_POSITION                  equ 0007h
PWM4DCH_PWMPW9_SIZE                      equ 0001h
PWM4DCH_PWMPW9_LENGTH                    equ 0001h
PWM4DCH_PWMPW9_MASK                      equ 0080h

