GopalSaraf/Practicals/PSDL/include/proc/pic16lf1768.inc
// Register: PWM5CLKCON
#define PWM5CLKCON PWM5CLKCON
PWM5CLKCON                               equ 0D9Eh
// bitfield definitions
PWM5CLKCON_CS_POSN                       equ 0000h
PWM5CLKCON_CS_POSITION                   equ 0000h
PWM5CLKCON_CS_SIZE                       equ 0002h
PWM5CLKCON_CS_LENGTH                     equ 0002h
PWM5CLKCON_CS_MASK                       equ 0003h
PWM5CLKCON_PS_POSN                       equ 0004h
PWM5CLKCON_PS_POSITION                   equ 0004h
PWM5CLKCON_PS_SIZE                       equ 0003h
PWM5CLKCON_PS_LENGTH                     equ 0003h
PWM5CLKCON_PS_MASK                       equ 0070h
PWM5CLKCON_PWM5CS0_POSN                  equ 0000h
PWM5CLKCON_PWM5CS0_POSITION              equ 0000h
PWM5CLKCON_PWM5CS0_SIZE                  equ 0001h
PWM5CLKCON_PWM5CS0_LENGTH                equ 0001h
PWM5CLKCON_PWM5CS0_MASK                  equ 0001h
PWM5CLKCON_PWM5CS1_POSN                  equ 0001h
PWM5CLKCON_PWM5CS1_POSITION              equ 0001h
PWM5CLKCON_PWM5CS1_SIZE                  equ 0001h
PWM5CLKCON_PWM5CS1_LENGTH                equ 0001h
PWM5CLKCON_PWM5CS1_MASK                  equ 0002h
PWM5CLKCON_PWM5CS2_POSN                  equ 0002h
PWM5CLKCON_PWM5CS2_POSITION              equ 0002h
PWM5CLKCON_PWM5CS2_SIZE                  equ 0001h
PWM5CLKCON_PWM5CS2_LENGTH                equ 0001h
PWM5CLKCON_PWM5CS2_MASK                  equ 0004h
PWM5CLKCON_PWM5PS0_POSN                  equ 0004h
PWM5CLKCON_PWM5PS0_POSITION              equ 0004h
PWM5CLKCON_PWM5PS0_SIZE                  equ 0001h
PWM5CLKCON_PWM5PS0_LENGTH                equ 0001h
PWM5CLKCON_PWM5PS0_MASK                  equ 0010h
PWM5CLKCON_PWM5PS1_POSN                  equ 0005h
PWM5CLKCON_PWM5PS1_POSITION              equ 0005h
PWM5CLKCON_PWM5PS1_SIZE                  equ 0001h
PWM5CLKCON_PWM5PS1_LENGTH                equ 0001h
PWM5CLKCON_PWM5PS1_MASK                  equ 0020h
PWM5CLKCON_PWM5PS2_POSN                  equ 0006h
PWM5CLKCON_PWM5PS2_POSITION              equ 0006h
PWM5CLKCON_PWM5PS2_SIZE                  equ 0001h
PWM5CLKCON_PWM5PS2_LENGTH                equ 0001h
PWM5CLKCON_PWM5PS2_MASK                  equ 0040h
PWM5CLKCON_PWM5CS_POSN                   equ 0000h
PWM5CLKCON_PWM5CS_POSITION               equ 0000h
PWM5CLKCON_PWM5CS_SIZE                   equ 0003h
PWM5CLKCON_PWM5CS_LENGTH                 equ 0003h
PWM5CLKCON_PWM5CS_MASK                   equ 0007h
PWM5CLKCON_PWM5PS_POSN                   equ 0004h
PWM5CLKCON_PWM5PS_POSITION               equ 0004h
PWM5CLKCON_PWM5PS_SIZE                   equ 0003h
PWM5CLKCON_PWM5PS_LENGTH                 equ 0003h
PWM5CLKCON_PWM5PS_MASK                   equ 0070h
PWM5CLKCON_CS0_POSN                      equ 0000h
PWM5CLKCON_CS0_POSITION                  equ 0000h
PWM5CLKCON_CS0_SIZE                      equ 0001h
PWM5CLKCON_CS0_LENGTH                    equ 0001h
PWM5CLKCON_CS0_MASK                      equ 0001h
PWM5CLKCON_CS1_POSN                      equ 0001h
PWM5CLKCON_CS1_POSITION                  equ 0001h
PWM5CLKCON_CS1_SIZE                      equ 0001h
PWM5CLKCON_CS1_LENGTH                    equ 0001h
PWM5CLKCON_CS1_MASK                      equ 0002h
PWM5CLKCON_CS2_POSN                      equ 0002h
PWM5CLKCON_CS2_POSITION                  equ 0002h
PWM5CLKCON_CS2_SIZE                      equ 0001h
PWM5CLKCON_CS2_LENGTH                    equ 0001h
PWM5CLKCON_CS2_MASK                      equ 0004h
PWM5CLKCON_PS0_POSN                      equ 0004h
PWM5CLKCON_PS0_POSITION                  equ 0004h
PWM5CLKCON_PS0_SIZE                      equ 0001h
PWM5CLKCON_PS0_LENGTH                    equ 0001h
PWM5CLKCON_PS0_MASK                      equ 0010h
PWM5CLKCON_PS1_POSN                      equ 0005h
PWM5CLKCON_PS1_POSITION                  equ 0005h
PWM5CLKCON_PS1_SIZE                      equ 0001h
PWM5CLKCON_PS1_LENGTH                    equ 0001h
PWM5CLKCON_PS1_MASK                      equ 0020h
PWM5CLKCON_PS2_POSN                      equ 0006h
PWM5CLKCON_PS2_POSITION                  equ 0006h
PWM5CLKCON_PS2_SIZE                      equ 0001h
PWM5CLKCON_PS2_LENGTH                    equ 0001h
PWM5CLKCON_PS2_MASK                      equ 0040h

// Register: PWM5LDCON
#define PWM5LDCON PWM5LDCON
PWM5LDCON                                equ 0D9Fh
// bitfield definitions
PWM5LDCON_LDS_POSN                       equ 0000h
PWM5LDCON_LDS_POSITION                   equ 0000h
PWM5LDCON_LDS_SIZE                       equ 0002h
PWM5LDCON_LDS_LENGTH                     equ 0002h
PWM5LDCON_LDS_MASK                       equ 0003h
PWM5LDCON_LDT_POSN                       equ 0006h
PWM5LDCON_LDT_POSITION                   equ 0006h
PWM5LDCON_LDT_SIZE                       equ 0001h
PWM5LDCON_LDT_LENGTH                     equ 0001h
PWM5LDCON_LDT_MASK                       equ 0040h
PWM5LDCON_LDA_POSN                       equ 0007h
PWM5LDCON_LDA_POSITION                   equ 0007h
PWM5LDCON_LDA_SIZE                       equ 0001h
PWM5LDCON_LDA_LENGTH                     equ 0001h
PWM5LDCON_LDA_MASK                       equ 0080h
PWM5LDCON_PWM5LDS0_POSN                  equ 0000h
PWM5LDCON_PWM5LDS0_POSITION              equ 0000h
PWM5LDCON_PWM5LDS0_SIZE                  equ 0001h
PWM5LDCON_PWM5LDS0_LENGTH                equ 0001h
PWM5LDCON_PWM5LDS0_MASK                  equ 0001h
PWM5LDCON_PWM5LDS_POSN                   equ 0000h
PWM5LDCON_PWM5LDS_POSITION               equ 0000h
PWM5LDCON_PWM5LDS_SIZE                   equ 0002h
PWM5LDCON_PWM5LDS_LENGTH                 equ 0002h
PWM5LDCON_PWM5LDS_MASK                   equ 0003h
PWM5LDCON_PWM5LDM_POSN                   equ 0006h
PWM5LDCON_PWM5LDM_POSITION               equ 0006h
PWM5LDCON_PWM5LDM_SIZE                   equ 0001h
PWM5LDCON_PWM5LDM_LENGTH                 equ 0001h
PWM5LDCON_PWM5LDM_MASK                   equ 0040h
PWM5LDCON_PWM5LD_POSN                    equ 0007h
PWM5LDCON_PWM5LD_POSITION                equ 0007h
PWM5LDCON_PWM5LD_SIZE                    equ 0001h
PWM5LDCON_PWM5LD_LENGTH                  equ 0001h
PWM5LDCON_PWM5LD_MASK                    equ 0080h
PWM5LDCON_LDS0_POSN                      equ 0000h
PWM5LDCON_LDS0_POSITION                  equ 0000h
PWM5LDCON_LDS0_SIZE                      equ 0001h
PWM5LDCON_LDS0_LENGTH                    equ 0001h
PWM5LDCON_LDS0_MASK                      equ 0001h

