GopalSaraf/Practicals/PSDL/include/proc/pic16lf1768.inc
#define LC2D3S4                          BANKMASK(CLC2SEL2), 4
#define LC2D4S0                          BANKMASK(CLC2SEL3), 0
#define LC2D4S1                          BANKMASK(CLC2SEL3), 1
#define LC2D4S2                          BANKMASK(CLC2SEL3), 2
#define LC2D4S3                          BANKMASK(CLC2SEL3), 3
#define LC2D4S4                          BANKMASK(CLC2SEL3), 4
#define LC2EN                            BANKMASK(CLC2CON), 7
#define LC2G1D1N                         BANKMASK(CLC2GLS0), 0
#define LC2G1D1T                         BANKMASK(CLC2GLS0), 1
#define LC2G1D2N                         BANKMASK(CLC2GLS0), 2
#define LC2G1D2T                         BANKMASK(CLC2GLS0), 3
#define LC2G1D3N                         BANKMASK(CLC2GLS0), 4
#define LC2G1D3T                         BANKMASK(CLC2GLS0), 5
#define LC2G1D4N                         BANKMASK(CLC2GLS0), 6
#define LC2G1D4T                         BANKMASK(CLC2GLS0), 7
#define LC2G1POL                         BANKMASK(CLC2POL), 0
#define LC2G2D1N                         BANKMASK(CLC2GLS1), 0
#define LC2G2D1T                         BANKMASK(CLC2GLS1), 1
#define LC2G2D2N                         BANKMASK(CLC2GLS1), 2
#define LC2G2D2T                         BANKMASK(CLC2GLS1), 3
#define LC2G2D3N                         BANKMASK(CLC2GLS1), 4
#define LC2G2D3T                         BANKMASK(CLC2GLS1), 5
#define LC2G2D4N                         BANKMASK(CLC2GLS1), 6
#define LC2G2D4T                         BANKMASK(CLC2GLS1), 7
#define LC2G2POL                         BANKMASK(CLC2POL), 1
#define LC2G3D1N                         BANKMASK(CLC2GLS2), 0
#define LC2G3D1T                         BANKMASK(CLC2GLS2), 1
#define LC2G3D2N                         BANKMASK(CLC2GLS2), 2
#define LC2G3D2T                         BANKMASK(CLC2GLS2), 3
#define LC2G3D3N                         BANKMASK(CLC2GLS2), 4
#define LC2G3D3T                         BANKMASK(CLC2GLS2), 5
#define LC2G3D4N                         BANKMASK(CLC2GLS2), 6
#define LC2G3D4T                         BANKMASK(CLC2GLS2), 7
#define LC2G3POL                         BANKMASK(CLC2POL), 2
#define LC2G4D1N                         BANKMASK(CLC2GLS3), 0
#define LC2G4D1T                         BANKMASK(CLC2GLS3), 1
#define LC2G4D2N                         BANKMASK(CLC2GLS3), 2
#define LC2G4D2T                         BANKMASK(CLC2GLS3), 3
#define LC2G4D3N                         BANKMASK(CLC2GLS3), 4
#define LC2G4D3T                         BANKMASK(CLC2GLS3), 5
#define LC2G4D4N                         BANKMASK(CLC2GLS3), 6
#define LC2G4D4T                         BANKMASK(CLC2GLS3), 7
#define LC2G4POL                         BANKMASK(CLC2POL), 3
#define LC2INTN                          BANKMASK(CLC2CON), 3
#define LC2INTP                          BANKMASK(CLC2CON), 4
#define LC2MODE0                         BANKMASK(CLC2CON), 0
#define LC2MODE1                         BANKMASK(CLC2CON), 1
#define LC2MODE2                         BANKMASK(CLC2CON), 2
#define LC2OUT                           BANKMASK(CLC2CON), 5
#define LC2POL                           BANKMASK(CLC2POL), 7
#define LC3D1S0                          BANKMASK(CLC3SEL0), 0
#define LC3D1S1                          BANKMASK(CLC3SEL0), 1
#define LC3D1S2                          BANKMASK(CLC3SEL0), 2
#define LC3D1S3                          BANKMASK(CLC3SEL0), 3
#define LC3D1S4                          BANKMASK(CLC3SEL0), 4
#define LC3D2S0                          BANKMASK(CLC3SEL1), 0
#define LC3D2S1                          BANKMASK(CLC3SEL1), 1
#define LC3D2S2                          BANKMASK(CLC3SEL1), 2
#define LC3D2S3                          BANKMASK(CLC3SEL1), 3
#define LC3D2S4                          BANKMASK(CLC3SEL1), 4
#define LC3D3S0                          BANKMASK(CLC3SEL2), 0
#define LC3D3S1                          BANKMASK(CLC3SEL2), 1
#define LC3D3S2                          BANKMASK(CLC3SEL2), 2
#define LC3D3S3                          BANKMASK(CLC3SEL2), 3
#define LC3D3S4                          BANKMASK(CLC3SEL2), 4
#define LC3D4S0                          BANKMASK(CLC3SEL3), 0
#define LC3D4S1                          BANKMASK(CLC3SEL3), 1
#define LC3D4S2                          BANKMASK(CLC3SEL3), 2
#define LC3D4S3                          BANKMASK(CLC3SEL3), 3
#define LC3D4S4                          BANKMASK(CLC3SEL3), 4
#define LC3EN                            BANKMASK(CLC3CON), 7
#define LC3G1D1N                         BANKMASK(CLC3GLS0), 0
#define LC3G1D1T                         BANKMASK(CLC3GLS0), 1
#define LC3G1D2N                         BANKMASK(CLC3GLS0), 2
#define LC3G1D2T                         BANKMASK(CLC3GLS0), 3
#define LC3G1D3N                         BANKMASK(CLC3GLS0), 4
#define LC3G1D3T                         BANKMASK(CLC3GLS0), 5
#define LC3G1D4N                         BANKMASK(CLC3GLS0), 6
#define LC3G1D4T                         BANKMASK(CLC3GLS0), 7
#define LC3G1POL                         BANKMASK(CLC3POL), 0
#define LC3G2D1N                         BANKMASK(CLC3GLS1), 0
#define LC3G2D1T                         BANKMASK(CLC3GLS1), 1
#define LC3G2D2N                         BANKMASK(CLC3GLS1), 2
#define LC3G2D2T                         BANKMASK(CLC3GLS1), 3
#define LC3G2D3N                         BANKMASK(CLC3GLS1), 4
#define LC3G2D3T                         BANKMASK(CLC3GLS1), 5
#define LC3G2D4N                         BANKMASK(CLC3GLS1), 6
#define LC3G2D4T                         BANKMASK(CLC3GLS1), 7
#define LC3G2POL                         BANKMASK(CLC3POL), 1
#define LC3G3D1N                         BANKMASK(CLC3GLS2), 0
#define LC3G3D1T                         BANKMASK(CLC3GLS2), 1
#define LC3G3D2N                         BANKMASK(CLC3GLS2), 2
#define LC3G3D2T                         BANKMASK(CLC3GLS2), 3
#define LC3G3D3N                         BANKMASK(CLC3GLS2), 4
#define LC3G3D3T                         BANKMASK(CLC3GLS2), 5
#define LC3G3D4N                         BANKMASK(CLC3GLS2), 6
#define LC3G3D4T                         BANKMASK(CLC3GLS2), 7
#define LC3G3POL                         BANKMASK(CLC3POL), 2
#define LC3G4D1N                         BANKMASK(CLC3GLS3), 0
#define LC3G4D1T                         BANKMASK(CLC3GLS3), 1
#define LC3G4D2N                         BANKMASK(CLC3GLS3), 2
#define LC3G4D2T                         BANKMASK(CLC3GLS3), 3
#define LC3G4D3N                         BANKMASK(CLC3GLS3), 4
#define LC3G4D3T                         BANKMASK(CLC3GLS3), 5
#define LC3G4D4N                         BANKMASK(CLC3GLS3), 6
#define LC3G4D4T                         BANKMASK(CLC3GLS3), 7
#define LC3G4POL                         BANKMASK(CLC3POL), 3
#define LC3INTN                          BANKMASK(CLC3CON), 3
#define LC3INTP                          BANKMASK(CLC3CON), 4
#define LC3MODE0                         BANKMASK(CLC3CON), 0
#define LC3MODE1                         BANKMASK(CLC3CON), 1
#define LC3MODE2                         BANKMASK(CLC3CON), 2
#define LC3OUT                           BANKMASK(CLC3CON), 5
#define LC3POL                           BANKMASK(CLC3POL), 7
#define LFIOFR                           BANKMASK(OSCSTAT), 1
#define LWLO                             BANKMASK(PMCON1), 5
#define MC1OUT                           BANKMASK(CMOUT), 0
#define MC2OUT                           BANKMASK(CMOUT), 1
#define MC3OUT                           BANKMASK(CMOUT), 2
#define MC4OUT                           BANKMASK(CMOUT), 3
#define MCLC1OUT                         BANKMASK(CLCDATA), 0
#define MCLC2OUT                         BANKMASK(CLCDATA), 1
#define MCLC3OUT                         BANKMASK(CLCDATA), 2
#define MD1BIT                           BANKMASK(MD1CON0), 0
#define MD1CH0                           BANKMASK(MD1CARH), 0
#define MD1CH1                           BANKMASK(MD1CARH), 1
#define MD1CH2                           BANKMASK(MD1CARH), 2
#define MD1CH3                           BANKMASK(MD1CARH), 3
#define MD1CHPOL                         BANKMASK(MD1CON1), 5
#define MD1CHSYNC                        BANKMASK(MD1CON1), 4
#define MD1CL0                           BANKMASK(MD1CARL), 0
#define MD1CL1                           BANKMASK(MD1CARL), 1
#define MD1CL2                           BANKMASK(MD1CARL), 2
#define MD1CL3                           BANKMASK(MD1CARL), 3
#define MD1CLPOL                         BANKMASK(MD1CON1), 1
#define MD1CLSYNC                        BANKMASK(MD1CON1), 0
#define MD1EN                            BANKMASK(MD1CON0), 7
#define MD1MS0                           BANKMASK(MD1SRC), 0
#define MD1MS1                           BANKMASK(MD1SRC), 1
#define MD1MS2                           BANKMASK(MD1SRC), 2
#define MD1MS3                           BANKMASK(MD1SRC), 3
#define MD1MS4                           BANKMASK(MD1SRC), 4
#define MD1OPOL                          BANKMASK(MD1CON0), 4
#define MD1OUT                           BANKMASK(MD1CON0), 5
#define MD2BIT                           BANKMASK(MD2CON0), 0
#define MD2CH0                           BANKMASK(MD2CARH), 0
#define MD2CH1                           BANKMASK(MD2CARH), 1
#define MD2CH2                           BANKMASK(MD2CARH), 2
#define MD2CH3                           BANKMASK(MD2CARH), 3
#define MD2CHPOL                         BANKMASK(MD2CON1), 5
#define MD2CHSYNC                        BANKMASK(MD2CON1), 4
#define MD2CL0                           BANKMASK(MD2CARL), 0
#define MD2CL1                           BANKMASK(MD2CARL), 1
#define MD2CL2                           BANKMASK(MD2CARL), 2
#define MD2CL3                           BANKMASK(MD2CARL), 3
#define MD2CLPOL                         BANKMASK(MD2CON1), 1
#define MD2CLSYNC                        BANKMASK(MD2CON1), 0
#define MD2EN                            BANKMASK(MD2CON0), 7
#define MD2MS0                           BANKMASK(MD2SRC), 0
#define MD2MS1                           BANKMASK(MD2SRC), 1
#define MD2MS2                           BANKMASK(MD2SRC), 2
#define MD2MS3                           BANKMASK(MD2SRC), 3
#define MD2MS4                           BANKMASK(MD2SRC), 4
#define MD2OPOL                          BANKMASK(MD2CON0), 4
#define MD2OUT                           BANKMASK(MD2CON0), 5
#define MFIOFR                           BANKMASK(OSCSTAT), 2
#define MPWM5EN                          BANKMASK(PWMEN), 4
#define MPWM5LD                          BANKMASK(PWMLD), 4
#define MPWM5OUT                         BANKMASK(PWMOUT), 4
#define MPWM6EN                          BANKMASK(PWMEN), 5
#define MPWM6LD                          BANKMASK(PWMLD), 5
#define MPWM6OUT                         BANKMASK(PWMOUT), 5
#define MSK0                             BANKMASK(SSP1MSK), 0
#define MSK1                             BANKMASK(SSP1MSK), 1
#define MSK2                             BANKMASK(SSP1MSK), 2
#define MSK3                             BANKMASK(SSP1MSK), 3
#define MSK4                             BANKMASK(SSP1MSK), 4
#define MSK5                             BANKMASK(SSP1MSK), 5
#define MSK6                             BANKMASK(SSP1MSK), 6
#define MSK7                             BANKMASK(SSP1MSK), 7
#define ODA0                             BANKMASK(ODCONA), 0
#define ODA1                             BANKMASK(ODCONA), 1
#define ODA2                             BANKMASK(ODCONA), 2
#define ODA4                             BANKMASK(ODCONA), 4
#define ODA5                             BANKMASK(ODCONA), 5
#define ODB4                             BANKMASK(ODCONB), 4
#define ODB5                             BANKMASK(ODCONB), 5
#define ODB6                             BANKMASK(ODCONB), 6
#define ODB7                             BANKMASK(ODCONB), 7
#define ODC0                             BANKMASK(ODCONC), 0
#define ODC1                             BANKMASK(ODCONC), 1
#define ODC2                             BANKMASK(ODCONC), 2
#define ODC3                             BANKMASK(ODCONC), 3
#define ODC4                             BANKMASK(ODCONC), 4
#define ODC5                             BANKMASK(ODCONC), 5
#define ODC6                             BANKMASK(ODCONC), 6
#define ODC7                             BANKMASK(ODCONC), 7
#define OERR                             BANKMASK(RC1STA), 1
#define OPA1EN                           BANKMASK(OPA1CON), 7
#define OPA1ORM0                         BANKMASK(OPA1CON), 0
#define OPA1ORM1                         BANKMASK(OPA1CON), 1
#define OPA1ORPOL                        BANKMASK(OPA1CON), 2
#define OPA1UG                           BANKMASK(OPA1CON), 4
#define OPA2EN                           BANKMASK(OPA2CON), 7
#define OPA2ORM0                         BANKMASK(OPA2CON), 0
#define OPA2ORM1                         BANKMASK(OPA2CON), 1
#define OPA2ORPOL                        BANKMASK(OPA2CON), 2
#define OPA2UG                           BANKMASK(OPA2CON), 4
#define OSCEN                            BANKMASK(T1CON), 3
#define OSFIE                            BANKMASK(PIE2), 7
#define OSFIF                            BANKMASK(PIR2), 7
#define OSTS                             BANKMASK(OSCSTAT), 5
#define P3TSEL0                          BANKMASK(CCPTMRS), 4
#define P3TSEL1                          BANKMASK(CCPTMRS), 5
#define P4TSEL0                          BANKMASK(CCPTMRS), 6
#define P4TSEL1                          BANKMASK(CCPTMRS), 7
#define PCIE                             BANKMASK(SSP1CON3), 6
#define PEIE                             BANKMASK(INTCON), 6
#define PEN                              BANKMASK(SSP1CON2), 2
#define PLLR                             BANKMASK(OSCSTAT), 6
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0
#define PSA                              BANKMASK(OPTION_REG), 3
#define PWM3DC0                          BANKMASK(PWM3DCL), 6
#define PWM3DC1                          BANKMASK(PWM3DCL), 7
#define PWM3DC2                          BANKMASK(PWM3DCH), 0
#define PWM3DC3                          BANKMASK(PWM3DCH), 1
#define PWM3DC4                          BANKMASK(PWM3DCH), 2
#define PWM3DC5                          BANKMASK(PWM3DCH), 3
#define PWM3DC6                          BANKMASK(PWM3DCH), 4
#define PWM3DC7                          BANKMASK(PWM3DCH), 5
#define PWM3DC8                          BANKMASK(PWM3DCH), 6
#define PWM3DC9                          BANKMASK(PWM3DCH), 7
#define PWM3EN                           BANKMASK(PWM3CON), 7
#define PWM3OUT                          BANKMASK(PWM3CON), 5
#define PWM3POL                          BANKMASK(PWM3CON), 4
#define PWM4DC0                          BANKMASK(PWM4DCL), 6
#define PWM4DC1                          BANKMASK(PWM4DCL), 7
#define PWM4DC2                          BANKMASK(PWM4DCH), 0
#define PWM4DC3                          BANKMASK(PWM4DCH), 1
#define PWM4DC4                          BANKMASK(PWM4DCH), 2
#define PWM4DC5                          BANKMASK(PWM4DCH), 3
#define PWM4DC6                          BANKMASK(PWM4DCH), 4
#define PWM4DC7                          BANKMASK(PWM4DCH), 5
#define PWM4DC8                          BANKMASK(PWM4DCH), 6
#define PWM4DC9                          BANKMASK(PWM4DCH), 7
#define PWM4EN                           BANKMASK(PWM4CON), 7
#define PWM4OUT                          BANKMASK(PWM4CON), 5
#define PWM4POL                          BANKMASK(PWM4CON), 4
#define PWM5CS0                          BANKMASK(PWM5CLKCON), 0
#define PWM5CS1                          BANKMASK(PWM5CLKCON), 1
#define PWM5CS2                          BANKMASK(PWM5CLKCON), 2
#define PWM5DCH0                         BANKMASK(PWM5DCH), 0
#define PWM5DCH1                         BANKMASK(PWM5DCH), 1
#define PWM5DCH2                         BANKMASK(PWM5DCH), 2
#define PWM5DCH3                         BANKMASK(PWM5DCH), 3
#define PWM5DCH4                         BANKMASK(PWM5DCH), 4
#define PWM5DCH5                         BANKMASK(PWM5DCH), 5
#define PWM5DCH6                         BANKMASK(PWM5DCH), 6
#define PWM5DCH7                         BANKMASK(PWM5DCH), 7
#define PWM5DCIE                         BANKMASK(PWM5INTE), 1
#define PWM5DCIF                         BANKMASK(PWM5INTF), 1
#define PWM5DCL0                         BANKMASK(PWM5DCL), 0
#define PWM5DCL1                         BANKMASK(PWM5DCL), 1
#define PWM5DCL2                         BANKMASK(PWM5DCL), 2
#define PWM5DCL3                         BANKMASK(PWM5DCL), 3
#define PWM5DCL4                         BANKMASK(PWM5DCL), 4
#define PWM5DCL5                         BANKMASK(PWM5DCL), 5
#define PWM5DCL6                         BANKMASK(PWM5DCL), 6
#define PWM5DCL7                         BANKMASK(PWM5DCL), 7
#define PWM5EN                           BANKMASK(PWM5CON), 7
#define PWM5IE                           BANKMASK(PIE3), 6
#define PWM5IF                           BANKMASK(PIR3), 6
#define PWM5LD                           BANKMASK(PWM5LDCON), 7
#define PWM5LDM                          BANKMASK(PWM5LDCON), 6
#define PWM5LDS0                         BANKMASK(PWM5LDCON), 0
#define PWM5MODE0                        BANKMASK(PWM5CON), 2
#define PWM5MODE1                        BANKMASK(PWM5CON), 3
#define PWM5OFH0                         BANKMASK(PWM5OFH), 0
#define PWM5OFH1                         BANKMASK(PWM5OFH), 1
#define PWM5OFH2                         BANKMASK(PWM5OFH), 2
#define PWM5OFH3                         BANKMASK(PWM5OFH), 3
#define PWM5OFH4                         BANKMASK(PWM5OFH), 4
#define PWM5OFH5                         BANKMASK(PWM5OFH), 5
#define PWM5OFH6                         BANKMASK(PWM5OFH), 6
#define PWM5OFH7                         BANKMASK(PWM5OFH), 7
#define PWM5OFIE                         BANKMASK(PWM5INTE), 3
#define PWM5OFIF                         BANKMASK(PWM5INTF), 3
#define PWM5OFL0                         BANKMASK(PWM5OFL), 0
#define PWM5OFL1                         BANKMASK(PWM5OFL), 1
#define PWM5OFL2                         BANKMASK(PWM5OFL), 2
#define PWM5OFL3                         BANKMASK(PWM5OFL), 3
#define PWM5OFL4                         BANKMASK(PWM5OFL), 4
#define PWM5OFL5                         BANKMASK(PWM5OFL), 5
#define PWM5OFL6                         BANKMASK(PWM5OFL), 6
#define PWM5OFL7                         BANKMASK(PWM5OFL), 7
#define PWM5OFM0                         BANKMASK(PWM5OFCON), 5
#define PWM5OFM1                         BANKMASK(PWM5OFCON), 6
#define PWM5OFMC                         BANKMASK(PWM5OFCON), 4
#define PWM5OFS0                         BANKMASK(PWM5OFCON), 0
#define PWM5OUT                          BANKMASK(PWM5CON), 5
#define PWM5PHH0                         BANKMASK(PWM5PHH), 0
#define PWM5PHH1                         BANKMASK(PWM5PHH), 1
#define PWM5PHH2                         BANKMASK(PWM5PHH), 2
#define PWM5PHH3                         BANKMASK(PWM5PHH), 3
#define PWM5PHH4                         BANKMASK(PWM5PHH), 4
#define PWM5PHH5                         BANKMASK(PWM5PHH), 5
#define PWM5PHH6                         BANKMASK(PWM5PHH), 6
#define PWM5PHH7                         BANKMASK(PWM5PHH), 7
#define PWM5PHIE                         BANKMASK(PWM5INTE), 2
#define PWM5PHIF                         BANKMASK(PWM5INTF), 2
#define PWM5PHL0                         BANKMASK(PWM5PHL), 0
#define PWM5PHL1                         BANKMASK(PWM5PHL), 1
#define PWM5PHL2                         BANKMASK(PWM5PHL), 2
#define PWM5PHL3                         BANKMASK(PWM5PHL), 3
#define PWM5PHL4                         BANKMASK(PWM5PHL), 4
#define PWM5PHL5                         BANKMASK(PWM5PHL), 5
#define PWM5PHL6                         BANKMASK(PWM5PHL), 6
#define PWM5PHL7                         BANKMASK(PWM5PHL), 7
#define PWM5POL                          BANKMASK(PWM5CON), 4
#define PWM5PRH0                         BANKMASK(PWM5PRH), 0
#define PWM5PRH1                         BANKMASK(PWM5PRH), 1
#define PWM5PRH2                         BANKMASK(PWM5PRH), 2
#define PWM5PRH3                         BANKMASK(PWM5PRH), 3
#define PWM5PRH4                         BANKMASK(PWM5PRH), 4
#define PWM5PRH5                         BANKMASK(PWM5PRH), 5
#define PWM5PRH6                         BANKMASK(PWM5PRH), 6
#define PWM5PRH7                         BANKMASK(PWM5PRH), 7
#define PWM5PRIE                         BANKMASK(PWM5INTE), 0
#define PWM5PRIF                         BANKMASK(PWM5INTF), 0
#define PWM5PRL0                         BANKMASK(PWM5PRL), 0
#define PWM5PRL1                         BANKMASK(PWM5PRL), 1
#define PWM5PRL2                         BANKMASK(PWM5PRL), 2
#define PWM5PRL3                         BANKMASK(PWM5PRL), 3
#define PWM5PRL4                         BANKMASK(PWM5PRL), 4
#define PWM5PRL5                         BANKMASK(PWM5PRL), 5
#define PWM5PRL6                         BANKMASK(PWM5PRL), 6
#define PWM5PRL7                         BANKMASK(PWM5PRL), 7
#define PWM5PS0                          BANKMASK(PWM5CLKCON), 4
#define PWM5PS1                          BANKMASK(PWM5CLKCON), 5
#define PWM5PS2                          BANKMASK(PWM5CLKCON), 6
#define PWM5TMRH0                        BANKMASK(PWM5TMRH), 0
#define PWM5TMRH1                        BANKMASK(PWM5TMRH), 1
#define PWM5TMRH2                        BANKMASK(PWM5TMRH), 2
#define PWM5TMRH3                        BANKMASK(PWM5TMRH), 3
#define PWM5TMRH4                        BANKMASK(PWM5TMRH), 4
#define PWM5TMRH5                        BANKMASK(PWM5TMRH), 5
#define PWM5TMRH6                        BANKMASK(PWM5TMRH), 6
#define PWM5TMRH7                        BANKMASK(PWM5TMRH), 7
#define PWM5TMRL0                        BANKMASK(PWM5TMRL), 0
#define PWM5TMRL1                        BANKMASK(PWM5TMRL), 1
#define PWM5TMRL2                        BANKMASK(PWM5TMRL), 2
#define PWM5TMRL3                        BANKMASK(PWM5TMRL), 3
#define PWM5TMRL4                        BANKMASK(PWM5TMRL), 4
#define PWM5TMRL5                        BANKMASK(PWM5TMRL), 5
#define PWM5TMRL6                        BANKMASK(PWM5TMRL), 6
#define PWM5TMRL7                        BANKMASK(PWM5TMRL), 7
#define PWM6CS0                          BANKMASK(PWM6CLKCON), 0
#define PWM6CS1                          BANKMASK(PWM6CLKCON), 1
#define PWM6CS2                          BANKMASK(PWM6CLKCON), 2
#define PWM6DCH0                         BANKMASK(PWM6DCH), 0
#define PWM6DCH1                         BANKMASK(PWM6DCH), 1
#define PWM6DCH2                         BANKMASK(PWM6DCH), 2
#define PWM6DCH3                         BANKMASK(PWM6DCH), 3
#define PWM6DCH4                         BANKMASK(PWM6DCH), 4
#define PWM6DCH5                         BANKMASK(PWM6DCH), 5
#define PWM6DCH6                         BANKMASK(PWM6DCH), 6
#define PWM6DCH7                         BANKMASK(PWM6DCH), 7
#define PWM6DCIE                         BANKMASK(PWM6INTE), 1
#define PWM6DCIF                         BANKMASK(PWM6INTF), 1
#define PWM6DCL0                         BANKMASK(PWM6DCL), 0
#define PWM6DCL1                         BANKMASK(PWM6DCL), 1
#define PWM6DCL2                         BANKMASK(PWM6DCL), 2
#define PWM6DCL3                         BANKMASK(PWM6DCL), 3
#define PWM6DCL4                         BANKMASK(PWM6DCL), 4
#define PWM6DCL5                         BANKMASK(PWM6DCL), 5
#define PWM6DCL6                         BANKMASK(PWM6DCL), 6
#define PWM6DCL7                         BANKMASK(PWM6DCL), 7
#define PWM6EN                           BANKMASK(PWM6CON), 7
#define PWM6IE                           BANKMASK(PIE3), 7
#define PWM6IF                           BANKMASK(PIR3), 7
#define PWM6LD                           BANKMASK(PWM6LDCON), 7
#define PWM6LDM                          BANKMASK(PWM6LDCON), 6
#define PWM6LDS0                         BANKMASK(PWM6LDCON), 0
#define PWM6MODE0                        BANKMASK(PWM6CON), 2
#define PWM6MODE1                        BANKMASK(PWM6CON), 3
